
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hayas1/tfgh/actions/runs/11776815676)



<pre><code>Apply complete! Resources: 1 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["tfgh"].github_branch.default: Refreshing state... [id=tfgh:main]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:52]
github_issue_label.update-snippets: Refreshing state... [id=tfgh:update-snippets]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"9eae8eefb50fd5708b0d9a40cbe8b94b38719dd78fa9fad4381c825a85e61247\"" -> "W/\"4f04c04528d269db8f7f333a3bdba35e893a5e13333a2fef3f42dc8751441caf\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.repositories["tfgh"].github_repository_pull_request.managed will be replaced, as requested
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "f8013e9243ad862d620f20b314be3bf9cbced371" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "11fa0dfcaa1db9362e1fd042f2b2494e696371ea" -> (known after apply)
      ~ id                    = "hayas1:tfgh:52" -> (known after apply)
      ~ labels                = [
          - "add-or-update",
          - "maintenance",
        ] -> (known after apply)
      ~ number                = 52 -> (known after apply)
      ~ opened_at             = 1731317813 -> (known after apply)
      ~ opened_by             = "terraform-apply[bot]" -> (known after apply)
      ~ state                 = "open" -> (known after apply)
      ~ updated_at            = 1731319448 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
module.repositories["tfgh"].github_repository_pull_request.managed: Destroying... [id=hayas1:tfgh:52]
module.repositories["tfgh"].github_repository_pull_request.managed: Destruction complete after 1s
module.repositories["tfgh"].github_repository_pull_request.managed: Creating...
module.repositories["tfgh"].github_repository_pull_request.managed: Creation complete after 3s [id=hayas1:tfgh:54]

Apply complete! Resources: 1 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":53,"Program":"tfcmt","SHA1":"17d73237e9abe29d661aa5a8140dd20f1d2757d3","Vars":{},"WorkflowName":"Terraform apply on push"} -->